{"blog":[{"author":"Andre Pestana","updated":"2022-10-09T17:55:54.000Z","title":"Welcome to my blog! 🎉","giphy":"https://giphy.com/embed/l1ugg8MSaCUpzyyyY","giphyPaddingBottom":"75%","path":"/sections/blog/posts/welcome-to-my-blog.html","excerpt":"Hello and welcome! I hope this is the first post of thousands more.For a long time, I've been looking for a blog solution like [Jekyll](https://jekyllrb.com/), [Vuepress](https://vuepress.vuejs.org/), or [Vitepress](https://vitepress.vuejs.org/) which could give me some freedom to do the things my way, would be low cost and simple. I've used Jekyll before and it was cool, but it is a Ruby app and I'm not interested in learning to code in Ruby now. Now I'm using Vitepress and I'm pretty satisfied with it. Some of the features I like about it are:"}],"articles":[{"title":"Learning Languages","author":"Andre Pestana","updated":"2023-08-11T14:11:20.000Z","tags":"language learning, spanish, french","path":"/sections/articles/posts/languages.html","excerpt":"Some resources for learning Spanish and French on the web."},{"author":"Andre Pestana","updated":"2023-05-19T13:16:39.000Z","title":"Testing connectivity between hosts","tags":"networking, docker, devops, testing","giphyPaddingBottom":"100%","path":"/sections/articles/posts/testing-connectiy-between-hosts.html","excerpt":"Often, when ensuring the availability and accessibility of your services, you may find it necessary to perform a simple test to check if a particular endpoint is hosting a running service. It's akin to knocking on a door to see if anyone's home—a straightforward gesture. However, you may lack the means to perform this \"knock\" yourself. By means, I refer to applications like telnet, which serves as a metaphorical hand to carry out the knocking process. Presently, it's quite common for operating systems to operate within lean Docker containers, devoid of telnet, curl, or nc commands. Consequently, I have compiled a list of alternatives for you to ensure that the endpoint you are testing indeed accepts connections."}],"projects":[{"title":"Chuck Norris Jokes","updated":"2022-10-16T19:48:42.000Z","author":"Andre Pestana","tags":"mobile, vue.js, javascript, quasarframework, fun, android","giphyPaddingBottom":"56%","path":"/sections/projects/posts/chuck-norris-jokes.html","excerpt":"> When Chuck Norris watches Dora the Explora, Dora doesn't ask any questions.That is one of many Chuck Norris Jokes you can find in this Android App. I created this app to learn how to build a hybrid mobile app."},{"title":"My own website","updated":"2022-10-16T19:19:10.000Z","author":"Andre Pestana","tags":"web, blog, vue.js, javascript, vitepress","giphyPaddingBottom":"75%","path":"/sections/projects/posts/my-own-website.html","excerpt":"This website is coded using [Vitepress](https://vitepress.vuejs.org/) that is a Static Site Generator. In order words: it doesn't use a Database to keep data and all pages are static but it used some tools that help editors to maintain and make it less static. The pages are written using Markdown and an elegant website structure is generated. Also with some code you can extend it and create other features to satisfy your needs."},{"title":"Pestana World game","updated":"2022-10-16T19:19:23.000Z","author":"Andre Pestana","tags":"game, javascript, phaser, fun","giphyPaddingBottom":"77%","path":"/sections/projects/posts/pestana-world-game.html","excerpt":"Imagine that it is raining beer and at the same time a new virus starts to spread around the town where you live. That is your mission in this game: drink as much beer as you can and run away from this terrible virus that can kill you.This is a work of fiction. Any similarity to actual persons, living or dead, or actual events, is purely coincidental. ;)"}]}